Revit 2024 API
Duct.DuctType Property
 The duct type of this duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DuctType DuctType { get; set; }
Visual Basic
Public Property DuctType As DuctType
	Get
	Set
Visual C++
public:
property DuctType^ DuctType {
	DuctType^ get ();
	void set (DuctType^ value);
}
See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace